# ------------------------------------------------------------------------------
#+TITLE:     Chapter 5: Managing Local Linux Users and Groups
#+SUBTITLE:  Kebairia Zakaria - July 2021
#+AUTHOR:    Kebairia Zakaria
#+EMAIL:     z.kebairia@esi-sba.dz
#+LANGUAGE:  en
#+STARTUP:   content showstars indent inlineimages hideblocks
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/zakaria/org/conf/rouger.css" />
#+OPTIONS:   toc:2 html-scripts:nil num:nil html-postamble:nil html-style:nil ^:nil
#+PROPERTY:  header-args  :dir /ssh:admin@alpha: :exports both
# ------------------------------------------------------------------------------
#+HTML: <div class="back"><a href="#table-of-contents">⌘ Back to top</a></div>
** ~useradd~ create users
- actualy, the =useradd= command is a fairly simple command, as we see earlier that in linux, there is the concept of *do one thing and do it well*.
  so here, the command =useradd= only helps us to create a new user, and with the help of its options we can specify specific inoformation along the creation of this user, lets see!:
  #+begin_src sh :results output :exports both
    sudo useradd --help
  #+end_src

  #+RESULTS:
  #+begin_example
  Usage: useradd [options] LOGIN
         useradd -D
         useradd -D [options]

  Options:
    -b, --base-dir BASE_DIR       base directory for the home directory of the
                                  new account
    -c, --comment COMMENT         GECOS field of the new account
    -d, --home-dir HOME_DIR       home directory of the new account
    -D, --defaults                print or change default useradd configuration
    -e, --expiredate EXPIRE_DATE  expiration date of the new account
    -f, --inactive INACTIVE       password inactivity period of the new account
    -g, --gid GROUP               name or ID of the primary group of the new
                                  account
    -G, --groups GROUPS           list of supplementary groups of the new
                                  account
    -h, --help                    display this help message and exit
    -k, --skel SKEL_DIR           use this alternative skeleton directory
    -K, --key KEY=VALUE           override /etc/login.defs defaults
    -l, --no-log-init             do not add the user to the lastlog and
                                  faillog databases
    -m, --create-home             create the user's home directory
    -M, --no-create-home          do not create the user's home directory
    -N, --no-user-group           do not create a group with the same name as
                                  the user
    -o, --non-unique              allow to create users with duplicate
                                  (non-unique) UID
    -p, --password PASSWORD       encrypted password of the new account
    -r, --system                  create a system account
    -R, --root CHROOT_DIR         directory to chroot into
    -P, --prefix PREFIX_DIR       prefix directory where are located the /etc/* files
    -s, --shell SHELL             login shell of the new account
    -u, --uid UID                 user ID of the new account
    -U, --user-group              create a group with the same name as the user
    -Z, --selinux-user SEUSER     use a specific SEUSER for the SELinux user mapping

  #+end_example
- to better understand these option, we will take the following scenario:
  let's create a user name *ahmed* with these specific information:
  | Name  | ahmed |
  |-------+-------|
  | Shell | bash  |
  |-------+-------|
  | UID   | 2000  |
  #+begin_src sh :results output :exports both
    sudo useradd -s $(which bash) -u 2000 ahmed
    grep "ahmed" /etc/passwd
  #+end_src

  #+RESULTS:
  : ahmed:x:2000:2000::/home/ahmed:/usr/bin/bash
- as we can see, the opiration is fairly easy, and it doesn't require a lot of skill to do that.

** ~userdel~ deletes a user
- let's create a testing account named demo
#+begin_src sh :results output
  sudo useradd -s $(which bash) demo
#+end_src

- after that, we will make him own some files
  #+begin_src sh :results output
    whoami
    mkdir -v demofiles
    touch demofiles/file{1..5}
    ls -l demofiles
  #+end_src

  #+RESULTS:
  : admin
  : total 0
  : -rw-rw-r--. 1 admin admin 0 Jul 22 19:08 file1
  : -rw-rw-r--. 1 admin admin 0 Jul 22 19:08 file2
  : -rw-rw-r--. 1 admin admin 0 Jul 22 19:08 file3
  : -rw-rw-r--. 1 admin admin 0 Jul 22 19:08 file4
  : -rw-rw-r--. 1 admin admin 0 Jul 22 19:08 file5

- we can see that these files are owned by the =admin= user, let's change their user and group ownership to the new user *demo*
  #+begin_src sh :results output
    sudo chown demo:demo demofiles/*
    ls -l demofiles
  #+end_src

  #+RESULTS:
  : total 0
  : -rw-rw-r--. 1 demo demo 0 Jul 22 19:08 file1
  : -rw-rw-r--. 1 demo demo 0 Jul 22 19:08 file2
  : -rw-rw-r--. 1 demo demo 0 Jul 22 19:08 file3
  : -rw-rw-r--. 1 demo demo 0 Jul 22 19:08 file4
  : -rw-rw-r--. 1 demo demo 0 Jul 22 19:08 file5
- after that we will delete the user =demo= so that these files will be, let say *orphants*, or files without user/group ownership
  #+begin_src sh :results output
    sudo userdel demo
    ls -l demofiles
  #+end_src

  #+RESULTS:
  : total 0
  : -rw-rw-r--. 1 1001 1001 0 Jul 22 19:08 file1
  : -rw-rw-r--. 1 1001 1001 0 Jul 22 19:08 file2
  : -rw-rw-r--. 1 1001 1001 0 Jul 22 19:08 file3
  : -rw-rw-r--. 1 1001 1001 0 Jul 22 19:08 file4
  : -rw-rw-r--. 1 1001 1001 0 Jul 22 19:08 file5
- there are multiple steps to fix this problem.
  1. we have to use the ~-r~ option with ~userdel~ command, as we can see this option helps us to remove files in the user's home directory, the home directory itself and the user mail spool.
  2. search for other files owned by this user, uid or search for any files that doesn't have user/group owner.
     you can mouve them to another location, delete them, tar them or change their ownership to another user and group
     #+begin_src sh :results output :exports both
       # change their user/group ownership into admin:admin
       sudo find / -nouser -nogroup 2> /dev/null -exec chown -v admin:admin {} \;
     #+end_src

     #+RESULTS:
     #+begin_example
     changed ownership of '/home/admin/demofiles/file1' from 1001:1001 to admin:admin
     changed ownership of '/home/admin/demofiles/file2' from 1001:1001 to admin:admin
     changed ownership of '/home/admin/demofiles/file3' from 1001:1001 to admin:admin
     changed ownership of '/home/admin/demofiles/file4' from 1001:1001 to admin:admin
     changed ownership of '/home/admin/demofiles/file5' from 1001:1001 to admin:admin
     changed ownership of '/home/demo' from 1001:1001 to admin:admin
     changed ownership of '/home/demo/.bash_logout' from 1001:1001 to admin:admin
     changed ownership of '/home/demo/.bash_profile' from 1001:1001 to admin:admin
     changed ownership of '/home/demo/.bashrc' from 1001:1001 to admin:admin
     #+end_example

